Studying/Music_App/app/controllers/albums_controller.rb

UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "trick"], ["updated_at", "2021-10-17 14:46:20.203497"], ["id", 4]]
---
  def update
    @album = get_album
    @band = @album.band
    if @album.update(album_params)

INSERT INTO "albums" ("title", "year", "band_id", "live?", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "New Album"], ["year", 1943], ["band_id", 3], ["live?", false], ["created_at", "2021-10-17 14:46:49.561008"], ["updated_at", "2021-10-17 14:46:49.561008"]]
---
  def create
    @album = Album.new(album_params)
    if @album.save

DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 4]]
---
  def destroy
    @album = get_album
    @album.destroy

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_album
    Album.find(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def get_band
    Band.find(params[:band_id])