Studying/Music_App/app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands"
---
  def new
    @album = Album.new
    @album.band_id = [params[:band_id]]
    @bands = Band.all

INSERT INTO "albums" ("title", "year", "band_id", "live?", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Some album"], ["year", 1943], ["band_id", 3], ["live?", false], ["created_at", "2021-10-17 03:37:12.423455"], ["updated_at", "2021-10-17 03:37:12.423455"]]
SELECT "bands".* FROM "bands"
---
  def create
    @album = Album.new(album_params)
    if @album.save
      flash[:messages] = ["Successfully created #{@album.title} for #{@album.band.name}"]
      redirect_to band_albums_url(@album.band_id)
    else
      flash.now[:errors] = @album.errors.full_messages
      @bands = Band.all

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def get_band
    Band.find(params[:band_id])