Studying/Music_App/app/controllers/bands_controller.rb

DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
  def destroy
    @band = get_band
    @band.destroy

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_band
    Band.find(params[:id])