Studying/Music_App/app/controllers/tracks_controller.rb

  def create
    @track = Track.new(track_params)
    # @track.album_id = params[:album_id]
    if @track.save
---
INSERT INTO "tracks" ("title", "ord", "album_id", "created_at", "updated_at", "lyrics", "bonus?") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Californication"], ["ord", 1], ["album_id", 1], ["created_at", "2021-10-17 17:19:15.659059"], ["updated_at", "2021-10-17 17:19:15.659059"], ["lyrics", "Sick lyrics"], ["bonus?", true]]

  def update
    @track = get_track
    if @track.update(track_params)
---
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "More lyrics"], ["updated_at", "2021-10-17 16:47:15.131070"], ["id", 1]]

  def get_track
    Track.find(params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]