Studying/Music_App/app/controllers/users_controller.rb

  def destroy
    @user = get_user
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]

  def get_user
    User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]