Studying/TodosRnd2/Todos2/app/controllers/api/todos_controller.rb

  def show
    todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    todo = Todo.new(todo_params)
    if todo.save
---
INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "New Todo Server"], ["body", "sdlfkjsdf"], ["created_at", "2021-11-15 04:13:15.784775"], ["updated_at", "2021-11-15 04:13:15.784775"]]

  def update
    todo = Todo.find(params[:id])
    if todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", true], ["updated_at", "2021-11-15 05:16:28.127086"], ["id", 26]]

  def destroy
    todo = Todo.find(params[:id])
    todo.destroy!
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 27]]