Studying/Music_App/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 2]]
---
  <tbody>
    <% @band.albums.each do |album| %>