Studying/Rails_1/URLShortener/app/models/shortened_url.rb

  def self.shorten(user, long_url)
    ShortenedUrl.new(
      user_id: user.id,
      long_url: long_url,
      short_url: ShortenedUrl.random_code)
    .save
---
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "GwZ7BCy-jTX83P5d3Ma_eQ"], ["long_url", "url.com"], ["user_id", 1], ["created_at", "2021-10-04 04:38:10.504677"], ["updated_at", "2021-10-04 04:38:10.504677"]]

  def self.random_code
    sr = SecureRandom::urlsafe_base64
    until !ShortenedUrl.exists?(short_url: sr)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "GwZ7BCy-jTX83P5d3Ma_eQ"], ["LIMIT", 1]]